from django.db import models
from django.shortcuts import reverse


class FoldNewOne(models.Model):
    name = models.CharField('Название склада', max_length=50)
    parknumber = models.IntegerField('Номер платформы')
    responsible = models.CharField('Ответственный', max_length=50, blank=True)
    adress = models.CharField('Адрес', max_length=200, blank=True)
    square = models.IntegerField('Площадь склада')

    def __str__(self):
        return str(self.name)

    def get_item_count(self):
        count = 0
        items = ItemNewOne.objects.all()
        for i in items:
            if i.foldid.id == self.id:
                count += 1
        return count

    def get_id(self):
        return self.id

    def get_absolute_url(self):
        return f'/folds/{self.id}'

    """def get_update_url(self):
        return reverse('fold_update_url',kwargs={'id': self.id})
"""
    class Meta:
        verbose_name = 'Склад'
        verbose_name_plural = 'Склады'


class ItemNewOne(models.Model):
    ITEM_CATEGORY = (
        ('Мебель', 'Мебель'),
        ('Стройматериалы', 'Строительные материалы'),
        ('Инструменты', 'Инструменты для выполнения строительных,отделочных работ'),
        ('Техника', 'Технические средства, машины для строительных, отделочных работ'),
    )

    ITEM_MODULE = (
        ('А', 'А'),
        ('Б', 'Б'),
        ('В', 'В'),
        ('Г', 'Г'),
        ('Д', 'Д'),
        ('Е', 'Е'),
        ('Ж', 'Ж'),
        ('З', 'З'),
    )

    ITEM_SECTION =(
        ('S-1', 'S-1'),
        ('S-2', 'S-2'),
        ('S-3', 'S-3'),
        ('S-4', 'S-4'),
        ('S-5', 'S-5'),
        ('S-6', 'S-6'),
        ('S-7', 'S-7'),
        ('S-8', 'S-8'),
        ('S-9', 'S-9'),
        ('S-10', 'S-10'),
        ('S-11', 'S-11'),
        ('S-12', 'S-12'),
        ('S-13', 'S-13'),
        ('S-14', 'S-14'),
        ('S-15', 'S-15'),
        ('S-16', 'S-16'),

    )

    ITEM_ROW=(
        ('1', '1'),
        ('2', '2'),
        ('3', '3'),
        ('4', '4'),
        ('5', '5'),
        ('6', '6'),
        ('7', '7'),
        ('8', '8'),
        ('9', '9'),
        ('10', '10'),
        ('11', '11'),
        ('12', '12'),
        ('13', '13'),
        ('14', '14'),
        ('15', '15'),
        ('16', '16'),
        ('17', '17'),
        ('18', '18'),
        ('19', '19'),
        ('20', '20'),
        ('21', '21'),
        ('22', '22'),
        ('23', '23'),
        ('24', '24'),
        ('25', '25'),
        ('26', '26'),
        ('27', '27'),
        ('28', '28'),
        ('29', '29'),
        ('30', '30'),
        ('31', '31'),
        ('32', '32'),

    )

    ITEM_PLACE = (
        ('М1', 'М1'),
        ('М2', 'М2'),
        ('М3', 'М3'),
        ('М4', 'М4'),
        ('М5', 'М5'),
        ('М6', 'М6'),
        ('М7', 'М7'),
        ('М8', 'М8'),
        ('М9', 'М9'),
        ('М10', 'М10'),
        ('М11', 'М11'),
        ('М12', 'М12'),
        ('М13', 'М13'),
        ('М14', 'М14'),
        ('М15', 'М15'),
        ('М16', 'М16'),
        ('М17', 'М17'),
        ('М18', 'М18'),
        ('М19', 'М19'),
        ('М20', 'М20'),
        ('М21', 'М21'),
        ('М22', 'М22'),
        ('М23', 'М23'),
        ('М24', 'М24'),
        ('М25', 'М25'),
        ('М26', 'М26'),
        ('М27', 'М27'),
        ('М28', 'М28'),
        ('М29', 'М29'),
        ('М30', 'М30'),
        ('М31', 'М31'),
        ('М32', 'М32'),
        ('М33', 'М33'),
        ('М34', 'М34'),
        ('М35', 'М35'),
        ('М36', 'М36'),
        ('М37', 'М37'),
        ('М38', 'М38'),
        ('М39', 'М39'),
        ('М40', 'М40'),
        ('М41', 'М41'),
        ('М42', 'М42'),
        ('М43', 'М43'),
        ('М44', 'М44'),
        ('М45', 'М45'),
        ('М46', 'М46'),
        ('М47', 'М47'),
        ('М48', 'М48'),
        ('М49', 'М49'),
        ('М50', 'М50'),
        ('М51', 'М51'),
        ('М52', 'М52'),
        ('М53', 'М53'),
        ('М54', 'М54'),
        ('М55', 'М55'),
        ('М56', 'М56'),
        ('М57', 'М57'),
        ('М58', 'М58'),
        ('М59', 'М59'),
        ('М60', 'М60'),
        ('М61', 'М61'),
        ('М62', 'М62'),
        ('М63', 'М63'),
        ('М64', 'М64'),
        ('М65', 'М65'),
        ('М66', 'М66'),
        ('М67', 'М67'),
        ('М68', 'М68'),
        ('М69', 'М69'),
        ('М70', 'М70'),
        ('М71', 'М71'),
        ('М72', 'М72'),
        ('М73', 'М73'),
        ('М74', 'М74'),
        ('М75', 'М75'),
        ('М76', 'М76'),
        ('М77', 'М77'),
        ('М78', 'М78'),
        ('М79', 'М79'),
        ('М80', 'М80'),
        ('М81', 'М81'),
        ('М82', 'М82'),
        ('М83', 'М83'),
        ('М84', 'М84'),
        ('М85', 'М85'),
        ('М86', 'М86'),
        ('М87', 'М87'),
        ('М88', 'М88'),
        ('М89', 'М89'),
        ('М90', 'М90'),
        ('М91', 'М91'),
        ('М92', 'М92'),
        ('М93', 'М93'),
        ('М94', 'М94'),
        ('М95', 'М95'),
        ('М96', 'М96'),
        ('М97', 'М97'),
        ('М98', 'М98'),
        ('М99', 'М99'),
        ('М100', 'М100'),
        ('М101', 'М101'),
        ('М102', 'М102'),
        ('М103', 'М103'),
        ('М104', 'М104'),
        ('М105', 'М105'),
        ('М106', 'М106'),
        ('М107', 'М107'),
        ('М108', 'М108'),
        ('М109', 'М109'),
        ('М110', 'М110'),
        ('М111', 'М111'),
        ('М112', 'М112'),
        ('М113', 'М113'),
        ('М114', 'М114'),
        ('М115', 'М115'),
        ('М116', 'М116'),
        ('М117', 'М117'),
        ('М118', 'М118'),
        ('М119', 'М119'),
        ('М120', 'М120'),
        ('М121', 'М121'),
        ('М122', 'М122'),
        ('М123', 'М123'),
        ('М124', 'М124'),
        ('М125', 'М125'),
        ('М126', 'М126'),
        ('М127', 'М127'),
        ('М128', 'М128'),
    )

    name = models.CharField('Наименование товара', max_length=100)
    category = models.CharField('Категория',max_length=150, choices=ITEM_CATEGORY)
    amount = models.IntegerField('Количество')
    shelflifeday = models.IntegerField('Дней хранения')
    option = models.TextField('Описание', blank=True)
    foldid = models.ForeignKey(FoldNewOne, on_delete=models.CASCADE, verbose_name="Склад", blank="True")
    camedate = models.DateField('Дата поставки', blank=True, null=True)
    module = models.CharField('Модуль склада', max_length=5,blank=True, choices=ITEM_MODULE)
    section = models.CharField('Секция модуля склада', max_length=5,blank=True, choices=ITEM_SECTION)
    row = models.CharField('Ряд секции', blank=True, max_length=5,choices=ITEM_ROW)
    place = models.CharField('Место в ряду', blank=True, max_length=5,choices=ITEM_PLACE)


    def __str__(self):
        return 'Наименование товара: ' + str(self.name) + '; Категория: ' + str(self.category)

    def get_id(self):
        return self.foldid.id

    def get_name(self):
        return self.name

    def get_absolute_url(self):
        return f'/items/{self.id}'

    class Meta:
        verbose_name = 'Товар'
        verbose_name_plural = 'Товары'
